Enums/УдалитьПричиныСписанияКодовМаркировкиИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УдалитьПричиныСписанияКодовМаркировкиИСМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеДоОбязательностиМаркировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДемонстрационныеОбразцы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользованиеДляСобственныхНуждСУплатойАкциза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстечениеСрока</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонфискацияТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛабораторныеОбразцы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛиквидацияПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтзывСРынка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рекламации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестированиеПродукта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уничтожен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утерян</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/УдалитьПричиныСписанияКодовМаркировкиИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ПричиныВыбытияКонструктораНастроекПоПеречислению() Экспорт
	
	Результат                   = Новый Соответствие;
	СправочникиПоИдентификатору = Новый Соответствие;
	Запрос                      = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПричиныВыводаИзОборотаИСМП.Ссылка,
		|	ПричиныВыводаИзОборотаИСМП.Имя
		|ИЗ
		|	Справочник.ПричиныВыводаИзОборотаИСМП КАК ПричиныВыводаИзОборотаИСМП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СправочникиПоИдентификатору.Вставить(Выборка.Имя, Выборка.Ссылка);
	КонецЦикла;
	
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаДляЦелейВРозницу, СправочникиПоИдентификатору["RETAIL"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа, СправочникиПоИдентификатору["RETAIL"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаЭкспортВСтраныЕАЭС, СправочникиПоИдентификатору["EEC_EXPORT"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаЭкспортЗаПределыСтранЕАЭС, СправочникиПоИдентификатору["BEYOND_EEC_EXPORT"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаВозвратФизическомуЛицу, СправочникиПоИдентификатору["RETURN"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаУтратаПовреждениеТовара, СправочникиПоИдентификатору["LOSS"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаУничтожениеТовара, СправочникиПоИдентификатору["DESTRUCTION"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаКонфискацияТовара, СправочникиПоИдентификатору["CONFISCATION"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаЛиквидацияПредприятия, СправочникиПоИдентификатору["LIQUIDATION"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаИспользованиеДляСобственныхНуждПредприятия, СправочникиПоИдентификатору["OWN_USE"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаПродажаПоОбразцамДистанционнаяПродажа, СправочникиПоИдентификатору["DISTANCE"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаДистанционнаяПродажа, СправочникиПоИдентификатору["DISTANCE"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаПродажаПоОбразцам, СправочникиПоИдентификатору["BY_SAMPLES"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаБрак, СправочникиПоИдентификатору["DEFECT"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаИстечениеСрокаГодности, СправочникиПоИдентификатору["EXPIRATION"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаЛабораторныеОбразцы, СправочникиПоИдентификатору["QA_SAMPLES"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаОтзывСРынка, СправочникиПоИдентификатору["RECALL"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаРекламации, СправочникиПоИдентификатору["COMPLAINTS"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаТестированиеПродукта, СправочникиПоИдентификатору["PRODUCT_TESTING"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаДругое, СправочникиПоИдентификатору["OTHER"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаДругиеПричины, СправочникиПоИдентификатору["OTHER"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаПродажаПоСделкеСоставляющейГосударственнуюТайну, СправочникиПоИдентификатору["STATE_SECRET"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаИспользованиеДляПроизводственныхЦелей, СправочникиПоИдентификатору["PRODUCTION_USE"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаУтилизацияТовара, СправочникиПоИдентификатору["UTILIZATION"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаПродажаПоГосударственномуКонтракту, СправочникиПоИдентификатору["STATE_CONTRACT"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаФасовка, СправочникиПоИдентификатору["PACKING"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаПродажаЧерезВендинговыйАппарат, СправочникиПоИдентификатору["VENDING"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаБезвозмезднаяПередача, СправочникиПоИдентификатору["DONATION"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаРеализацияНезарегистрированномуУчастнику, СправочникиПоИдентификатору["TRANSFER_UNREGISTERED"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаИспользованиеДляМедицинскогоПрименения, СправочникиПоИдентификатору["MEDICAL_USE"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаКорректировкаОстатковОСУ, СправочникиПоИдентификатору["BALANCE_CORRECTION"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаИспользованиеДляВетеринарногоПрименения, СправочникиПоИдентификатору["VETERINARY_USE"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаПересортицаПоКодам, СправочникиПоИдентификатору["MISMATCH"]);
	
	Для Каждого Элемент Из Перечисления.УдалитьПричиныСписанияКодовМаркировкиИСМП Цикл
		Результат.Вставить(
			Перечисления.УдалитьПричиныСписанияКодовМаркировкиИСМП[XMLСтрока(Элемент)],
			СправочникиПоИдентификатору[ПричинаСписанияКМ(Элемент)]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПричинаСписанияКМ(Знач ЗначениеПоиска)
	
	Если ЗначениеПоиска = Испорчен Тогда
		Возврат "DEFECT";
	ИначеЕсли ЗначениеПоиска = ИстечениеСрока Тогда
		Возврат "EXPIRY";
	ИначеЕсли ЗначениеПоиска = ВыбытиеДоОбязательностиМаркировки Тогда
		Возврат "BEFORE_MARKING";
	ИначеЕсли ЗначениеПоиска = Уничтожен Тогда
		Возврат "DESTRUCTION";
	ИначеЕсли ЗначениеПоиска = Утерян Тогда
		Возврат "DAMAGE_LOSS";
	ИначеЕсли ЗначениеПоиска = Прочее Тогда
		Возврат "OTHER";	
	ИначеЕсли ЗначениеПоиска = ЛабораторныеОбразцы Тогда
		Возврат "QA_SAMPLES";	
	ИначеЕсли ЗначениеПоиска = ОтзывСРынка Тогда
		Возврат "PRODUCT_RECALL";
	ИначеЕсли ЗначениеПоиска = Рекламации Тогда
		Возврат "COMPLAINTS";	
	ИначеЕсли ЗначениеПоиска = ТестированиеПродукта Тогда
		Возврат "PRODUCT_TESTING";	
	ИначеЕсли ЗначениеПоиска = ДемонстрационныеОбразцы Тогда
		Возврат "DEMO_SAMPLES";	
	ИначеЕсли ЗначениеПоиска = ЛиквидацияПредприятия Тогда
		Возврат "LIQUIDATION";	
	ИначеЕсли ЗначениеПоиска = КонфискацияТоваров Тогда
		Возврат "CONFISCATION";
	ИначеЕсли ЗначениеПоиска = ИспользованиеДляСобственныхНуждСУплатойАкциза Тогда
		Возврат "OWN_USE_EXCISE";
	КонецЕсли;
	
КонецФункции

Функция ПричиныСписаниеЧерезСУЗМехКонструктораНастроекПоПеречислению() Экспорт
	
	Результат                   = Новый Соответствие;
	СправочникиПоИдентификатору = Новый Соответствие;
	
	Запрос                      = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПричиныВыводаИзОборотаИСМП.Ссылка,
		|	ПричиныВыводаИзОборотаИСМП.Имя
		|ИЗ
		|	Справочник.ПричиныВыводаИзОборотаИСМП КАК ПричиныВыводаИзОборотаИСМП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СправочникиПоИдентификатору.Вставить(Выборка.Имя, Выборка.Ссылка);
	КонецЦикла;
	
	СправочникиПоИдентификатору.Вставить("", Справочники.ПричиныВыводаИзОборотаИСМП.ПустаяСсылка());
	
	Для Каждого Элемент Из Перечисления.УдалитьПричиныСписанияКодовМаркировкиИСМП Цикл
		Результат.Вставить(
			Перечисления.УдалитьПричиныСписанияКодовМаркировкиИСМП[XMLСтрока(Элемент)],
			СправочникиПоИдентификатору[ПричинаСписанияЧерезСУЗМех(Элемент)]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПричиныСписаниеЧерезГИСМТКонструктораНастроекПоПеречислению() Экспорт
	
	Результат                   = Новый Соответствие;
	СправочникиПоИдентификатору = Новый Соответствие;
	
	Запрос                      = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПричиныВыводаИзОборотаИСМП.Ссылка,
		|	ПричиныВыводаИзОборотаИСМП.Имя
		|ИЗ
		|	Справочник.ПричиныВыводаИзОборотаИСМП КАК ПричиныВыводаИзОборотаИСМП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СправочникиПоИдентификатору.Вставить(Выборка.Имя, Выборка.Ссылка);
	КонецЦикла;
	
	СправочникиПоИдентификатору.Вставить("", Справочники.ПричиныВыводаИзОборотаИСМП.ПустаяСсылка());
	
	Для Каждого Элемент Из Перечисления.УдалитьПричиныСписанияКодовМаркировкиИСМП Цикл
		Результат.Вставить(
			Перечисления.УдалитьПричиныСписанияКодовМаркировкиИСМП[XMLСтрока(Элемент)],
			СправочникиПоИдентификатору[ПричинаСписанияЧерезГИСМТ(Элемент)]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПричинаСписанияЧерезСУЗМех(Знач ЗначениеПоиска)
	
	Если ЗначениеПоиска = Испорчен Тогда
		Возврат "CORRUPTED";
	ИначеЕсли ЗначениеПоиска = Утерян Тогда
		Возврат "LOST";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПричинаСписанияЧерезГИСМТ(Знач ЗначениеПоиска)
	
	Если ЗначениеПоиска = Испорчен Тогда
		Возврат "KM_SPOILED";
	ИначеЕсли ЗначениеПоиска = Утерян Тогда
		Возврат "KM_LOST";
	ИначеЕсли ЗначениеПоиска = Уничтожен Тогда
		Возврат "KM_DESTROYED";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
